#cyberTechnology

1.情報セキュリティマネジメント
2.ネットワークインフラセキュリティ
3.アプリケーションセキュリティ（Web、電子メール、DNS）
4.OSセキュリティ（Unix、Windows、Trusted OS）
5.ファイアウォール
6.侵入検知システム
7.ウイルス
8.セキュアプログラミング技法
9.セキュリティ運用
10.セキュリティプロトコル
11.認証
12.PKI
13.暗号
14.電子署名
15.不正アクセス手法
16.法令・規格

１．情報セキュリティマネジメントの理解
情報セキュリティマネジメントを学ぶことで、守るべき情報が何か、どんな方法がいいかなどを理解することが大事！
２．アプリケーションやネットワークの知識
アプリケーションなどはずっと一緒ではなく古いものから新しいものに変わっていく
それに対してセキュリティの対策の仕方なども変わってくる。新旧問わない幅広いアプリケーション知識やネットワーク知識が必要になる。
３．ウイルスや不正アクセスの手法などの攻撃の知識
まずはどんな攻撃をしてくるかを知見を持ち、それに対する対策を立てる。
ペネトレーションテストも行い向上させる。
４．コミュニケーション能力
セキュリティ対策の提案、交渉、システムに関する情報のヒアリング、設計や対策方法の内容説明など、クライアントとのやり取りも多くある。
円滑にコミュニケーションをとりながら要望を聞きとり、的確なセキュリティ対策をするためにコミュニケーション能力は必要！
５．モラル・責任感
他者の個人情報を含むセキュリティにかかわる高度な機密情報を取り扱うことになる。万一情報が漏えいした場合は、双方におおきな被害が出る、信頼の失望や損失など、そのため常に情報漏えいにきを払い、高いモラルと強い責任感が必要！
６．洞察力・想像力
高度な技術を持ったものも少ないため、想定外の攻撃を仕掛けてくる可能性もある。
そのため、犯罪者の背景を想像し対策するスキルも必要！
